validation/polydisperseBubbleFoam/fluidizedBed/constant/turbulenceProperties.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel kineticTheory;

    turbulence      on;
    printCoeffs     on;

    kineticTheoryCoeffs
    {
        kineticTheoryModel      anisotropicGaussian;

        anisotropicGaussianCoeffs
        {
            alphaTheta              1.0;
            e                       0.8;
            alphaMax                0.62;
            alphaMinFriction        0.5;
            residualAlpha           1e-4;

            viscosityModel          Gidaspow;
            conductivityModel       Gidaspow;
            granularPressureModel   Lun;
            frictionalStressModel   JohnsonJackson;
            radialModel             SinclairJackson;
            h2FnMethod              alphaG0;
            h2FnParaPow             2;

            JohnsonJacksonCoeffs
            {
                Fr                      0.05;
                eta                     2;
                p                       5;
                phi                     28.5;
                alphaDeltaMin           0.05;
            }
        }
    }

    phasePressureCoeffs
    {
        preAlphaExp     500;
        expMax          1000;
        alphaMax        0.62;
        g0              1000;
}
}

// ************************************************************************* //
